// Приведенный ниже блок ifdef - это стандартный метод создания макросов, упрощающий процедуру 
// экспорта из библиотек DLL. Все файлы данной DLL скомпилированы с использованием символа AUTOBOTPROUDP_EXPORTS,
// в командной строке. Этот символ не должен быть определен в каком-либо проекте
// использующем данную DLL. Благодаря этому любой другой проект, чьи исходные файлы включают данный файл, видит 
// функции AUTOBOTPROUDP_API как импортированные из DLL, тогда как данная DLL видит символы,
// определяемые данным макросом, как экспортированные.
#ifdef AUTOBOTPROUDP_EXPORTS
#define AUTOBOTPROUDP_API __declspec(dllexport)
#else
#define AUTOBOTPROUDP_API __declspec(dllimport)
#endif
